In [1]:
import pandas as pd

In [2]:
people = {
    "first": ["Corey", "Jane", "John"],
    "last": ["Schafer", "Doe", "Doe"],
    "email": ["CoreyMSchafer@gmail.com", "JaneDoe@email.com", "JohnDoe@email.com"],
}

df = pd.DataFrame(people)

df.head()

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

# Add columns

In [3]:
df["first"] + " " + df["last"]

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [4]:
# add new full_name column by Series value
df["full_name"] = df["first"] + " " + df["last"]

In [5]:
df.head()

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [6]:
df.drop(columns=["first", "last"], inplace=True)

In [7]:
df.head()

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [8]:
df["full_name"].str.split(" ")

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [17]:
df["full_name"].str.split(" ", expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [18]:
df[["first", "last"]] = df["full_name"].str.split(" ", expand=True)

In [19]:
df.head()

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

# Add rows

In [20]:
df.append({"first": "Tony"}, ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [22]:
people = {
    "first": ["Tony", "Steve"],
    "last": ["Stark", "Rogers"],
    "email": ["IronMan@gmail.com", "Cap@email.com"],
}

df2 = pd.DataFrame(people)

df2.head()

   first    last              email
0   Tony   Stark  IronMan@gmail.com
1  Steve  Rogers      Cap@email.com

In [23]:
df = df.append(df2, ignore_index=True, sort=False)

df.head()

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3        IronMan@gmail.com            NaN   Tony    Stark
4            Cap@email.com            NaN  Steve   Rogers

In [24]:
df.drop(index=4, inplace=True)

df.head()

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3        IronMan@gmail.com            NaN   Tony    Stark

In [25]:
df.drop(index=df[df["last"] == "Doe"].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3        IronMan@gmail.com            NaN   Tony    Stark

In [26]:
df["last"] == "Doe"

0    False
1     True
2     True
3    False
Name: last, dtype: bool

In [27]:
df[df["last"] == "Doe"]

               email full_name first last
1  JaneDoe@email.com  Jane Doe  Jane  Doe
2  JohnDoe@email.com  John Doe  John  Doe

In [28]:
df[df["last"] == "Doe"].index

Int64Index([1, 2], dtype='int64')

In [29]:
filt = df["last"] == "Doe"
df.drop(index=df[filt].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3        IronMan@gmail.com            NaN   Tony    Stark